yelp_clone/app/views/restaurants/index.html.haml

SELECT  1 AS one FROM "restaurants" INNER JOIN "reviews" ON "restaurants"."id" = "reviews"."restaurant_id" WHERE "reviews"."user_id" = $1 AND "restaurants"."id" = $2 LIMIT $3  [["user_id", 1505], ["id", 1038], ["LIMIT", 1]]
SELECT "restaurants".* FROM "restaurants"
---
      = link_to "Review #{restaurant.name}", new_restaurant_review_path(restaurant)
      -if @user.restaurants.include?( restaurant )

SELECT  1 AS one FROM "reviews" WHERE "reviews"."restaurant_id" = $1 LIMIT $2  [["restaurant_id", 1030], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = $1  [["restaurant_id", 1038]]
---
        = link_to "Delete #{restaurant.name}", restaurant_path(restaurant), :method => :delete
    - if restaurant.reviews.any?