yelp_clone/app/controllers/restaurants_controller.rb

  def create
    @user = current_user
    @restaurant = @user.restaurants.new(restaurant_params)
    if @restaurant.save
---
INSERT INTO "restaurants" ("name", "created_at", "updated_at", "description", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "KFC"], ["created_at", 2017-01-13 15:34:21 UTC], ["updated_at", 2017-01-13 15:34:21 UTC], ["description", "Deep fried goodness"], ["user_id", 1494]]