yelp_clone/app/controllers/reviews_controller.rb

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 1038], ["LIMIT", 1]]
INSERT INTO "reviews" ("thoughts", "rating", "created_at", "updated_at", "restaurant_id", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["thoughts", "so so"], ["rating", 3], ["created_at", 2017-01-13 15:34:23 UTC], ["updated_at", 2017-01-13 15:34:23 UTC], ["restaurant_id", 1038], ["user_id", 1505]]
---
  def create
    @user = current_user
    @restaurant = Restaurant.find(params[:restaurant_id])
    review = @restaurant.reviews.create(review_params)

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 1040], ["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = $1 AND "reviews"."id" = $2 LIMIT $3  [["restaurant_id", 1040], ["id", 314], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 314]]
---
  def destroy
    @restaurant = Restaurant.find(params[:restaurant_id])
    @review = @restaurant.reviews.find(params[:id])
    @review.destroy